app/Controllers/C_absensi.php

SELECT `tb_jadwal_pelajaran`.`id` as `id_jadwal_pelajaran`, `tb_jadwal_pelajaran`.`hari`, `tb_jadwal_pelajaran`.`jam_ke`, `tb_kelas`.`id` as `id_kelas`, `tb_kelas`.`nama_kelas`, `tb_mata_pelajaran`.`id` as `id_mapel`, `tb_mata_pelajaran`.`nama_mapel`, `tb_tahun_ajaran`.`id` as `id_tahun_ajaran`, `tb_tahun_ajaran`.`tahun_ajaran`, `tb_tahun_ajaran`.`semester`, `tb_pengguna`.`id` as `id_guru`, `tb_pengguna`.`nama` as `nama_guru`
FROM `tb_jadwal_pelajaran`
LEFT JOIN `tb_kelas` ON `tb_jadwal_pelajaran`.`id_kelas` = `tb_kelas`.`id`
LEFT JOIN `tb_mata_pelajaran` ON `tb_jadwal_pelajaran`.`id_mapel` = `tb_mata_pelajaran`.`id`
LEFT JOIN `tb_tahun_ajaran` ON `tb_kelas`.`id_tahun_ajaran` = `tb_tahun_ajaran`.`id`
LEFT JOIN `tb_pengguna` ON `tb_mata_pelajaran`.`id_guru` = `tb_pengguna`.`id`
WHERE `tb_jadwal_pelajaran`.`id` = '83'
SELECT `tb_absensi`.*, `tb_siswa`.`nama_siswa`
FROM `tb_absensi`
LEFT JOIN `tb_siswa` ON `tb_absensi`.`id_siswa` = `tb_siswa`.`id`
WHERE `tb_absensi`.`id_jadwal_pelajaran` = '83'
AND `tb_absensi`.`tanggal` = '2024-11-13'
ORDER BY `tb_siswa`.`nama_siswa` ASC
---
    public function edit($id_jadwal_pelajaran, $tanggal = null)
    {
        $data['title'] = 'Ubah Data Absensi';
        $data['jadwal_pelajaran'] = $this->M_jadwal_pelajaran
            ->select(
                '
            tb_jadwal_pelajaran.id as id_jadwal_pelajaran, tb_jadwal_pelajaran.hari, tb_jadwal_pelajaran.jam_ke,
            tb_kelas.id as id_kelas, tb_kelas.nama_kelas,
            tb_mata_pelajaran.id as id_mapel, tb_mata_pelajaran.nama_mapel,
            tb_tahun_ajaran.id as id_tahun_ajaran, tb_tahun_ajaran.tahun_ajaran, tb_tahun_ajaran.semester,
            tb_pengguna.id as id_guru, tb_pengguna.nama as nama_guru'
            )
            ->join('tb_kelas', 'tb_jadwal_pelajaran.id_kelas = tb_kelas.id', 'left')
            ->join('tb_mata_pelajaran', 'tb_jadwal_pelajaran.id_mapel = tb_mata_pelajaran.id', 'left')
            ->join('tb_tahun_ajaran', 'tb_kelas.id_tahun_ajaran = tb_tahun_ajaran.id', 'left')
            ->join('tb_pengguna', 'tb_mata_pelajaran.id_guru = tb_pengguna.id', 'left')
            ->find($id_jadwal_pelajaran);

        $data['tanggal'] = $tanggal ?? date('Y-m-d');
        $data['absensi'] = $this->M_absensi
            ->select('tb_absensi.*, tb_siswa.nama_siswa')
            ->join('tb_siswa', 'tb_absensi.id_siswa = tb_siswa.id', 'left')
            ->where('tb_absensi.id_jadwal_pelajaran', $id_jadwal_pelajaran)
            ->where('tb_absensi.tanggal', $tanggal)
            ->orderBy('tb_siswa.nama_siswa', 'asc')
            ->findAll();

SELECT `tb_jadwal_pelajaran`.`id`, `tb_jadwal_pelajaran`.`hari`, `tb_jadwal_pelajaran`.`jam_ke`, `tb_kelas`.`id` as `id_kelas`, `tb_kelas`.`nama_kelas`, `tb_mata_pelajaran`.`id` as `id_mapel`, `tb_mata_pelajaran`.`nama_mapel`, `tb_tahun_ajaran`.`id` as `id_tahun_ajaran`, `tb_tahun_ajaran`.`tahun_ajaran`, `tb_tahun_ajaran`.`semester`, `tb_pengguna`.`id` as `id_guru`, `tb_pengguna`.`nama` as `nama_guru`
FROM `tb_jadwal_pelajaran`
LEFT JOIN `tb_kelas` ON `tb_jadwal_pelajaran`.`id_kelas` = `tb_kelas`.`id`
LEFT JOIN `tb_mata_pelajaran` ON `tb_jadwal_pelajaran`.`id_mapel` = `tb_mata_pelajaran`.`id`
LEFT JOIN `tb_tahun_ajaran` ON `tb_kelas`.`id_tahun_ajaran` = `tb_tahun_ajaran`.`id`
LEFT JOIN `tb_pengguna` ON `tb_mata_pelajaran`.`id_guru` = `tb_pengguna`.`id`
WHERE `tb_jadwal_pelajaran`.`id` = '83'
SELECT *
FROM `tb_siswa`
JOIN `tb_absensi` ON `tb_absensi`.`id_siswa` = `tb_siswa`.`id`
WHERE `tb_absensi`.`id_jadwal_pelajaran` = '83'
AND `tb_absensi`.`tanggal` = '2024-11-13'
ORDER BY `tb_siswa`.`nama_siswa` ASC
---
    public function get_siswa($id_jadwal_pelajaran)
    {
        $data['title'] = 'Ubah Data Absensi';
        $data['jadwal_pelajaran'] = $this->M_jadwal_pelajaran
            ->select(
                '
            tb_jadwal_pelajaran.id, tb_jadwal_pelajaran.hari, tb_jadwal_pelajaran.jam_ke,
            tb_kelas.id as id_kelas, tb_kelas.nama_kelas,
            tb_mata_pelajaran.id as id_mapel, tb_mata_pelajaran.nama_mapel,
            tb_tahun_ajaran.id as id_tahun_ajaran, tb_tahun_ajaran.tahun_ajaran, tb_tahun_ajaran.semester,
            tb_pengguna.id as id_guru, tb_pengguna.nama as nama_guru'
            )
            ->join('tb_kelas', 'tb_jadwal_pelajaran.id_kelas = tb_kelas.id', 'left')
            ->join('tb_mata_pelajaran', 'tb_jadwal_pelajaran.id_mapel = tb_mata_pelajaran.id', 'left')
            ->join('tb_tahun_ajaran', 'tb_kelas.id_tahun_ajaran = tb_tahun_ajaran.id', 'left')
            ->join('tb_pengguna', 'tb_mata_pelajaran.id_guru = tb_pengguna.id', 'left')
            ->find($id_jadwal_pelajaran);

        // Ambil tanggal dari input form
        $tanggal = $this->request->getPost('tanggal');

        // 1. Ambil siswa yang sudah ada di absensi berdasarkan tanggal dan jadwal pelajaran
        $data['siswa'] = $this->M_siswa
            ->join('tb_absensi', 'tb_absensi.id_siswa = tb_siswa.id')
            ->where('tb_absensi.id_jadwal_pelajaran', $id_jadwal_pelajaran)
            ->where('tb_absensi.tanggal', $tanggal)
            ->orderBy('tb_siswa.nama_siswa', 'asc')
            ->findAll();

SELECT *
FROM `tb_siswa`
WHERE `tb_siswa`.`id_kelas` = '6'
---
        // 2. Jika data absensi tidak ditemukan (kosong), ambil semua siswa di jadwal pelajaran tersebut
        if (empty($data['siswa'])) {
            // Ambil semua siswa di jadwal pelajaran tersebut
            $data['siswa'] = $this->M_siswa
                ->where('tb_siswa.id_kelas', $data['jadwal_pelajaran']['id_kelas'])
                ->findAll();

SELECT *
FROM `tb_absensi`
WHERE `id_siswa` = '51'
AND `id_jadwal_pelajaran` = '83'
AND `tanggal` = '2024-11-13'
 LIMIT 1
INSERT INTO `tb_absensi` (`id_jadwal_pelajaran`, `id_siswa`, `tanggal`) VALUES ('83', '51', '2024-11-13')
---
            // 3. Masukkan data absensi baru untuk setiap siswa dengan status null
            foreach ($data['siswa'] as $siswa) {
                // Cek apakah siswa sudah ada absensinya pada tanggal tersebut
                $existingAbsensi = $this->M_absensi
                    ->where('id_siswa', $siswa['id'])
                    ->where('id_jadwal_pelajaran', $id_jadwal_pelajaran)
                    ->where('tanggal', $tanggal)
                    ->first();  // Mengambil 1 data jika ada

                // Jika absensi tidak ada, insert ke tabel absensi
                if (!$existingAbsensi) {
                    $this->M_absensi->insert([
                        'id_jadwal_pelajaran' => $id_jadwal_pelajaran,
                        'id_siswa' => $siswa['id'],
                        'tanggal'  => $tanggal,
                    ]);

SELECT `tb_absensi`.*, `tb_siswa`.`nama_siswa`
FROM `tb_absensi`
LEFT JOIN `tb_siswa` ON `tb_absensi`.`id_siswa` = `tb_siswa`.`id`
WHERE `tb_absensi`.`id_jadwal_pelajaran` = '84'
AND `tb_absensi`.`tanggal` = '2024-11-13'
UPDATE `tb_absensi` SET `status` = 'Hadir', `keterangan` = '', `updated_at` = '2024-11-13 14:05:46'
WHERE `tb_absensi`.`id` IN ('1')
---
    public function update($id_jadwal_pelajaran, $tanggal = null)
    {
        $absensi = $this->M_absensi
            ->select('tb_absensi.*, tb_siswa.nama_siswa')
            ->join('tb_siswa', 'tb_absensi.id_siswa = tb_siswa.id', 'left')
            ->where('tb_absensi.id_jadwal_pelajaran', $id_jadwal_pelajaran)
            ->where('tb_absensi.tanggal', $tanggal)
            ->findAll();

        // Update status dan keterangan untuk setiap siswa
        $errors = [];
        foreach ($absensi as $item) {
            $id_siswa   = $item['id_siswa'];
            $status     = $this->request->getPost("status_{$id_siswa}");
            $keterangan = $this->request->getPost("keterangan_{$id_siswa}");

            if ($status && in_array($status, ['Hadir', 'Tidak Hadir', 'Izin', 'Sakit'])) {
                // Perbarui status dan keterangan absensi
                $updateData = [
                    'status'     => $status,
                    'keterangan' => $keterangan,
                    'updated_at' => date('Y-m-d H:i:s'),
                ];

                // Update ke database
                if (!$this->M_absensi->update($item['id'], $updateData)) {