app/Controllers/C_auth.php

SELECT *
FROM `tb_pengguna`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $title = 'Masuk';

        // Proses saat formulir login di-submit
        if ($this->request->getMethod() === 'POST') {
            // Ambil email dan password dari input form
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            // Cek apakah email dan password valid
            $model = new M_pengguna();
            $user = $model->where('email', $email)->first();  // Cari pengguna berdasarkan email