app/Controllers/C_mata_pelajaran.php

SELECT `tb_mata_pelajaran`.*, `tb_tahun_ajaran`.`id` as `tahun_ajaran_id`, `tb_tahun_ajaran`.`tahun_ajaran`, `tb_tahun_ajaran`.`semester`, `tb_pengguna`.`id` as `guru_id`, `tb_pengguna`.`nama` as `nama_guru`
FROM `tb_mata_pelajaran`
LEFT JOIN `tb_tahun_ajaran` ON `tb_mata_pelajaran`.`id_tahun_ajaran` = `tb_tahun_ajaran`.`id`
LEFT JOIN `tb_pengguna` ON `tb_mata_pelajaran`.`id_guru` = `tb_pengguna`.`id`
ORDER BY `tb_tahun_ajaran`.`tahun_ajaran` DESC, `tb_tahun_ajaran`.`semester` DESC, `tb_mata_pelajaran`.`nama_mapel` ASC, `tb_pengguna`.`nama` ASC
---
    public function index()
    {
        $data['title']          = 'Daftar Data Mata Pelajaran';
        $data['mata_pelajaran'] = $this->M_mata_pelajaran
            ->select(
                'tb_mata_pelajaran.*,
                tb_tahun_ajaran.id as tahun_ajaran_id, tb_tahun_ajaran.tahun_ajaran, tb_tahun_ajaran.semester,
                tb_pengguna.id as guru_id, tb_pengguna.nama as nama_guru'
            )
            ->join('tb_tahun_ajaran', 'tb_mata_pelajaran.id_tahun_ajaran = tb_tahun_ajaran.id', 'left')
            ->join('tb_pengguna', 'tb_mata_pelajaran.id_guru = tb_pengguna.id', 'left')
            ->orderBy('tb_tahun_ajaran.tahun_ajaran', 'desc')
            ->orderBy('tb_tahun_ajaran.semester', 'desc')
            ->orderBy('tb_mata_pelajaran.nama_mapel', 'asc')
            ->orderBy('tb_pengguna.nama', 'asc')
            ->findAll();