app/Controllers/C_nilai_siswa.php

SELECT `tb_jadwal_pelajaran`.`id` as `id_jadwal_pelajaran`, `tb_jadwal_pelajaran`.`hari`, `tb_jadwal_pelajaran`.`jam_ke`, `tb_kelas`.`id` as `id_kelas`, `tb_kelas`.`nama_kelas`, `tb_mata_pelajaran`.`id` as `id_mapel`, `tb_mata_pelajaran`.`nama_mapel`, `tb_tahun_ajaran`.`id` as `id_tahun_ajaran`, `tb_tahun_ajaran`.`tahun_ajaran`, `tb_tahun_ajaran`.`semester`, `tb_pengguna`.`id` as `id_guru`, `tb_pengguna`.`nama` as `nama_guru`
FROM `tb_jadwal_pelajaran`
LEFT JOIN `tb_kelas` ON `tb_jadwal_pelajaran`.`id_kelas` = `tb_kelas`.`id`
LEFT JOIN `tb_mata_pelajaran` ON `tb_jadwal_pelajaran`.`id_mapel` = `tb_mata_pelajaran`.`id`
LEFT JOIN `tb_tahun_ajaran` ON `tb_kelas`.`id_tahun_ajaran` = `tb_tahun_ajaran`.`id`
LEFT JOIN `tb_pengguna` ON `tb_mata_pelajaran`.`id_guru` = `tb_pengguna`.`id`
ORDER BY `tb_tahun_ajaran`.`tahun_ajaran` DESC, `tb_tahun_ajaran`.`semester` DESC, `tb_kelas`.`nama_kelas` ASC, `tb_mata_pelajaran`.`nama_mapel` ASC, `tb_pengguna`.`nama` ASC
---
    public function index()
    {
        $data['title']            = 'Daftar Data Nilai Siswa';

        // Mulai query untuk mengambil jadwal pelajaran
        $builder = $this->M_jadwal_pelajaran
            ->select(
                'tb_jadwal_pelajaran.id as id_jadwal_pelajaran,
        tb_jadwal_pelajaran.hari, tb_jadwal_pelajaran.jam_ke,
        tb_kelas.id as id_kelas, tb_kelas.nama_kelas,
        tb_mata_pelajaran.id as id_mapel, tb_mata_pelajaran.nama_mapel,
        tb_tahun_ajaran.id as id_tahun_ajaran, tb_tahun_ajaran.tahun_ajaran, tb_tahun_ajaran.semester,
        tb_pengguna.id as id_guru, tb_pengguna.nama as nama_guru'
            )
            ->join('tb_kelas', 'tb_jadwal_pelajaran.id_kelas = tb_kelas.id', 'left')
            ->join('tb_mata_pelajaran', 'tb_jadwal_pelajaran.id_mapel = tb_mata_pelajaran.id', 'left')
            ->join('tb_tahun_ajaran', 'tb_kelas.id_tahun_ajaran = tb_tahun_ajaran.id', 'left')
            ->join('tb_pengguna', 'tb_mata_pelajaran.id_guru = tb_pengguna.id', 'left')
            ->orderBy('tb_tahun_ajaran.tahun_ajaran', 'desc')
            ->orderBy('tb_tahun_ajaran.semester', 'desc')
            ->orderBy('tb_kelas.nama_kelas', 'asc')
            ->orderBy('tb_mata_pelajaran.nama_mapel', 'asc')
            ->orderBy('tb_pengguna.nama', 'asc');