app/Controllers/C_peran.php

    public function index()
    {
        $data['title'] = 'Daftar Data Peran';
        $data['peran'] = $this->M_peran->orderBy('id', 'desc')->findAll();
---
SELECT *
FROM `tb_peran`
ORDER BY `id` DESC