app/Controllers/C_pengguna.php

SELECT `tb_pengguna`.*, `tb_peran`.`id` as `peran_id`, `tb_peran`.`nama_peran`
FROM `tb_pengguna`
LEFT JOIN `tb_peran` ON `tb_pengguna`.`id_peran` = `tb_peran`.`id`
ORDER BY `id` DESC
---
    public function index()
    {
        $data['title']    = 'Daftar Data Pengguna';
        $data['pengguna'] = $this->M_pengguna
            ->select('tb_pengguna.*, tb_peran.id as peran_id ,tb_peran.nama_peran')
            ->join('tb_peran', 'tb_pengguna.id_peran = tb_peran.id', 'left')
            ->orderBy('id', 'desc')
            ->findAll();