app/Controllers/C_profil_saya.php

SELECT `tb_siswa`.*, `tb_kelas`.`id` as `id_kelas`, `tb_kelas`.`nama_kelas`, `tb_tahun_ajaran`.`id` as `id_tahun_ajaran`, `tb_tahun_ajaran`.`tahun_ajaran`, `tb_tahun_ajaran`.`semester`
FROM `tb_siswa`
LEFT JOIN `tb_kelas` ON `tb_siswa`.`id_kelas` = `tb_kelas`.`id`
LEFT JOIN `tb_tahun_ajaran` ON `tb_kelas`.`id_tahun_ajaran` = `tb_tahun_ajaran`.`id`
WHERE `tb_siswa`.`id` = '3'
 LIMIT 1
---
    public function index()
    {
        $id_login            = session()->get('loggedUser')['id'];
        $data['title']       = 'Data Profil Saya';
        $data['profil_saya'] = $this->M_siswa
            ->select('
                tb_siswa.*,
                tb_kelas.id as id_kelas, tb_kelas.nama_kelas,
                tb_tahun_ajaran.id as id_tahun_ajaran, tb_tahun_ajaran.tahun_ajaran, tb_tahun_ajaran.semester')
            ->join('tb_kelas', 'tb_siswa.id_kelas = tb_kelas.id', 'left')
            ->join('tb_tahun_ajaran', 'tb_kelas.id_tahun_ajaran = tb_tahun_ajaran.id', 'left')
            ->where('tb_siswa.id', $id_login)
            ->first();

SELECT *
FROM `tb_siswa`
WHERE `tb_siswa`.`id` = '3'
UPDATE `tb_siswa` SET `password` = '$2y$10$8ZN8ICn/08VJcN2Hq3y/auKAQ.8nbQNAHHFQspZTwEe6xJVxRQmtq'
WHERE `tb_siswa`.`id` IN ('3')
---
    public function update($id)
    {
        $rules = [
            'password'         => 'required|min_length[6]',
            'password_confirm' => 'matches[password]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        try {
            $penggunaLama = $this->M_siswa->find($id);
            $password     = $this->request->getPost('password')
                ? password_hash($this->request->getPost('password'), PASSWORD_DEFAULT)
                :      $penggunaLama['password'];

            $this->M_siswa->update($id, [
                'password' => $password,
            ]);