app/Controllers/C_rapor_siswa.php

    public function index()
    {
        $data['title'] = 'Daftar Data Rapor Siswa';

        // Mulai query untuk mengambil jadwal pelajaran
        $builder = $this->M_kelas
            ->select(
                'tb_kelas.id as id_kelas, tb_kelas.nama_kelas,
                tb_tahun_ajaran.id as id_tahun_ajaran, tb_tahun_ajaran.tahun_ajaran, tb_tahun_ajaran.semester,
                tb_pengguna.id as id_guru_wali, tb_pengguna.nama as nama_guru_wali'
            )
            ->join('tb_tahun_ajaran', 'tb_kelas.id_tahun_ajaran = tb_tahun_ajaran.id', 'left')
            ->join('tb_pengguna', 'tb_kelas.id_guru_Wali = tb_pengguna.id', 'left')
            ->orderBy('tb_tahun_ajaran.tahun_ajaran', 'desc')
            ->orderBy('tb_tahun_ajaran.semester', 'desc')
            ->orderBy('tb_kelas.nama_kelas', 'asc')
            ->orderBy('tb_pengguna.nama', 'asc');

        // Jika id_login bukan '1', tambahkan kondisi where untuk membatasi berdasarkan id_guru
        $id_login = (session()->get('loggedUser')['id'] ?? 'ID');
        if ($id_login != '1') {
            $builder->where('tb_pengguna.id', $id_login);
        }

        // Ambil hasil query
        $data['kelas'] = $builder->findAll();
---
SELECT `tb_kelas`.`id` as `id_kelas`, `tb_kelas`.`nama_kelas`, `tb_tahun_ajaran`.`id` as `id_tahun_ajaran`, `tb_tahun_ajaran`.`tahun_ajaran`, `tb_tahun_ajaran`.`semester`, `tb_pengguna`.`id` as `id_guru_wali`, `tb_pengguna`.`nama` as `nama_guru_wali`
FROM `tb_kelas`
LEFT JOIN `tb_tahun_ajaran` ON `tb_kelas`.`id_tahun_ajaran` = `tb_tahun_ajaran`.`id`
LEFT JOIN `tb_pengguna` ON `tb_kelas`.`id_guru_Wali` = `tb_pengguna`.`id`
ORDER BY `tb_tahun_ajaran`.`tahun_ajaran` DESC, `tb_tahun_ajaran`.`semester` DESC, `tb_kelas`.`nama_kelas` ASC, `tb_pengguna`.`nama` ASC

    public function show($id_rapor_siswa)
    {
        $data['title'] = 'Ubah Data Rapor Siswa';

        $data['rapor_siswa'] = $this->M_rapor_siswa
            ->select(
                'tb_rapor_siswa.id as id_rapor_siswa, tb_rapor_siswa.catatan, tb_rapor_siswa.hasil_keputusan,
            tb_kelas.id as id_kelas, tb_kelas.nama_kelas,
            tb_tahun_ajaran.tahun_ajaran, tb_tahun_ajaran.semester,
            tb_siswa.id as id_siswa, tb_siswa.nama_siswa, tb_siswa.nisn'
            )
            ->join('tb_kelas', 'tb_rapor_siswa.id_kelas = tb_kelas.id', 'left')
            ->join('tb_tahun_ajaran', 'tb_kelas.id_tahun_ajaran = tb_tahun_ajaran.id', 'left')
            ->join('tb_siswa', 'tb_rapor_siswa.id_siswa = tb_siswa.id', 'left')
            ->find($id_rapor_siswa);

        $data['nilai_siswa'] = $this->M_nilai_siswa
            ->select('tb_nilai_siswa.id as id_nilai_siswa, tb_nilai_siswa.kkm, tb_nilai_siswa.nilai_hasil_pengetahuan_angka, tb_nilai_siswa.nilai_hasil_pengetahuan_huruf, tb_nilai_siswa.nilai_hasil_praktik_angka, tb_nilai_siswa.nilai_hasil_praktik_huruf, tb_nilai_siswa.sikap_efektif_predikat,
                    tb_mata_pelajaran.id as id_mapel, tb_mata_pelajaran.nama_mapel,
                    tb_siswa.id as id_siswa, tb_siswa.nama_siswa')
            ->join('tb_mata_pelajaran', 'tb_nilai_siswa.id_mapel = tb_mata_pelajaran.id', 'left')
            ->join('tb_siswa', 'tb_nilai_siswa.id_siswa = tb_siswa.id', 'left')
            ->where('id_siswa', $data['rapor_siswa']['id_siswa'])
            ->orderBy('tb_mata_pelajaran.nama_mapel', 'asc')
            ->findAll();

        $data['ekstra_kurikuler'] = $this->M_ekstra_kurikuler
            ->where('id_rapor_siswa',  $data['rapor_siswa']['id_rapor_siswa'])
            ->first();

        $data['kepribadian'] = $this->M_kepribadian
            ->where('id_rapor_siswa',  $data['rapor_siswa']['id_rapor_siswa'])
            ->first();
---
SELECT `tb_rapor_siswa`.`id` as `id_rapor_siswa`, `tb_rapor_siswa`.`catatan`, `tb_rapor_siswa`.`hasil_keputusan`, `tb_kelas`.`id` as `id_kelas`, `tb_kelas`.`nama_kelas`, `tb_tahun_ajaran`.`tahun_ajaran`, `tb_tahun_ajaran`.`semester`, `tb_siswa`.`id` as `id_siswa`, `tb_siswa`.`nama_siswa`, `tb_siswa`.`nisn`
FROM `tb_rapor_siswa`
LEFT JOIN `tb_kelas` ON `tb_rapor_siswa`.`id_kelas` = `tb_kelas`.`id`
LEFT JOIN `tb_tahun_ajaran` ON `tb_kelas`.`id_tahun_ajaran` = `tb_tahun_ajaran`.`id`
LEFT JOIN `tb_siswa` ON `tb_rapor_siswa`.`id_siswa` = `tb_siswa`.`id`
WHERE `tb_rapor_siswa`.`id` = '10'
SELECT `tb_nilai_siswa`.`id` as `id_nilai_siswa`, `tb_nilai_siswa`.`kkm`, `tb_nilai_siswa`.`nilai_hasil_pengetahuan_angka`, `tb_nilai_siswa`.`nilai_hasil_pengetahuan_huruf`, `tb_nilai_siswa`.`nilai_hasil_praktik_angka`, `tb_nilai_siswa`.`nilai_hasil_praktik_huruf`, `tb_nilai_siswa`.`sikap_efektif_predikat`, `tb_mata_pelajaran`.`id` as `id_mapel`, `tb_mata_pelajaran`.`nama_mapel`, `tb_siswa`.`id` as `id_siswa`, `tb_siswa`.`nama_siswa`
FROM `tb_nilai_siswa`
LEFT JOIN `tb_mata_pelajaran` ON `tb_nilai_siswa`.`id_mapel` = `tb_mata_pelajaran`.`id`
LEFT JOIN `tb_siswa` ON `tb_nilai_siswa`.`id_siswa` = `tb_siswa`.`id`
WHERE `id_siswa` = '53'
ORDER BY `tb_mata_pelajaran`.`nama_mapel` ASC
SELECT *
FROM `tb_ekstra_kurikuler`
WHERE `id_rapor_siswa` = '10'
 LIMIT 1
SELECT *
FROM `tb_kepribadian`
WHERE `id_rapor_siswa` = '10'
 LIMIT 1

        //     ->where('tb_jadwal_pelajaran.id_kelas', $data['rapor_siswa']['id_kelas'])
        //     ->findAll();

        $data['absensi'] = $this->M_absensi
            ->select('tb_absensi.status, COUNT(tb_absensi.status) as jumlah')
            ->join('tb_jadwal_pelajaran', 'tb_absensi.id_jadwal_pelajaran = tb_jadwal_pelajaran.id', 'left')
            ->where('tb_absensi.id_siswa', $data['rapor_siswa']['id_siswa'])
            ->where('tb_jadwal_pelajaran.id_kelas', $data['rapor_siswa']['id_kelas'])
            ->groupBy('tb_absensi.status')
            ->findAll();
---
SELECT `tb_absensi`.`status`, COUNT(tb_absensi.status) as jumlah
FROM `tb_absensi`
LEFT JOIN `tb_jadwal_pelajaran` ON `tb_absensi`.`id_jadwal_pelajaran` = `tb_jadwal_pelajaran`.`id`
WHERE `tb_absensi`.`id_siswa` = '53'
AND `tb_jadwal_pelajaran`.`id_kelas` = '6'
GROUP BY `tb_absensi`.`status`

    public function print($id_rapor_siswa)
    {
        $data['rapor_siswa'] = $this->M_rapor_siswa
            ->select(
                'tb_rapor_siswa.id as id_rapor_siswa, tb_rapor_siswa.catatan, tb_rapor_siswa.hasil_keputusan,
        tb_kelas.id as id_kelas, tb_kelas.nama_kelas,
        tb_tahun_ajaran.tahun_ajaran, tb_tahun_ajaran.semester,
        tb_siswa.id as id_siswa, tb_siswa.nama_siswa, tb_siswa.nisn'
            )
            ->join('tb_kelas', 'tb_rapor_siswa.id_kelas = tb_kelas.id', 'left')
            ->join('tb_tahun_ajaran', 'tb_kelas.id_tahun_ajaran = tb_tahun_ajaran.id', 'left')
            ->join('tb_siswa', 'tb_rapor_siswa.id_siswa = tb_siswa.id', 'left')
            ->find($id_rapor_siswa);

        $data['nilai_siswa'] = $this->M_nilai_siswa
            ->select('tb_nilai_siswa.id as id_nilai_siswa, tb_nilai_siswa.kkm, tb_nilai_siswa.nilai_hasil_pengetahuan_angka, tb_nilai_siswa.nilai_hasil_pengetahuan_huruf, tb_nilai_siswa.nilai_hasil_praktik_angka, tb_nilai_siswa.nilai_hasil_praktik_huruf, tb_nilai_siswa.sikap_efektif_predikat,
                tb_mata_pelajaran.id as id_mapel, tb_mata_pelajaran.nama_mapel,
                tb_siswa.id as id_siswa, tb_siswa.nama_siswa')
            ->join('tb_mata_pelajaran', 'tb_nilai_siswa.id_mapel = tb_mata_pelajaran.id', 'left')
            ->join('tb_siswa', 'tb_nilai_siswa.id_siswa = tb_siswa.id', 'left')
            ->where('id_siswa', $data['rapor_siswa']['id_siswa'])
            ->orderBy('tb_mata_pelajaran.nama_mapel', 'asc')
            ->findAll();

        $data['ekstra_kurikuler'] = $this->M_ekstra_kurikuler
            ->where('id_rapor_siswa',  $data['rapor_siswa']['id_rapor_siswa'])
            ->first();

        $data['kepribadian'] = $this->M_kepribadian
            ->where('id_rapor_siswa',  $data['rapor_siswa']['id_rapor_siswa'])
            ->first();
---
SELECT `tb_rapor_siswa`.`id` as `id_rapor_siswa`, `tb_rapor_siswa`.`catatan`, `tb_rapor_siswa`.`hasil_keputusan`, `tb_kelas`.`id` as `id_kelas`, `tb_kelas`.`nama_kelas`, `tb_tahun_ajaran`.`tahun_ajaran`, `tb_tahun_ajaran`.`semester`, `tb_siswa`.`id` as `id_siswa`, `tb_siswa`.`nama_siswa`, `tb_siswa`.`nisn`
FROM `tb_rapor_siswa`
LEFT JOIN `tb_kelas` ON `tb_rapor_siswa`.`id_kelas` = `tb_kelas`.`id`
LEFT JOIN `tb_tahun_ajaran` ON `tb_kelas`.`id_tahun_ajaran` = `tb_tahun_ajaran`.`id`
LEFT JOIN `tb_siswa` ON `tb_rapor_siswa`.`id_siswa` = `tb_siswa`.`id`
WHERE `tb_rapor_siswa`.`id` = '10'
SELECT `tb_nilai_siswa`.`id` as `id_nilai_siswa`, `tb_nilai_siswa`.`kkm`, `tb_nilai_siswa`.`nilai_hasil_pengetahuan_angka`, `tb_nilai_siswa`.`nilai_hasil_pengetahuan_huruf`, `tb_nilai_siswa`.`nilai_hasil_praktik_angka`, `tb_nilai_siswa`.`nilai_hasil_praktik_huruf`, `tb_nilai_siswa`.`sikap_efektif_predikat`, `tb_mata_pelajaran`.`id` as `id_mapel`, `tb_mata_pelajaran`.`nama_mapel`, `tb_siswa`.`id` as `id_siswa`, `tb_siswa`.`nama_siswa`
FROM `tb_nilai_siswa`
LEFT JOIN `tb_mata_pelajaran` ON `tb_nilai_siswa`.`id_mapel` = `tb_mata_pelajaran`.`id`
LEFT JOIN `tb_siswa` ON `tb_nilai_siswa`.`id_siswa` = `tb_siswa`.`id`
WHERE `id_siswa` = '53'
ORDER BY `tb_mata_pelajaran`.`nama_mapel` ASC
SELECT *
FROM `tb_ekstra_kurikuler`
WHERE `id_rapor_siswa` = '10'
 LIMIT 1
SELECT *
FROM `tb_kepribadian`
WHERE `id_rapor_siswa` = '10'
 LIMIT 1

        //     ->where('tb_jadwal_pelajaran.id_kelas', $data['rapor_siswa']['id_kelas'])
        //     ->findAll();

        $data['absensi'] = $this->M_absensi
            ->select('tb_absensi.status, COUNT(tb_absensi.status) as jumlah')
            ->join('tb_jadwal_pelajaran', 'tb_absensi.id_jadwal_pelajaran = tb_jadwal_pelajaran.id', 'left')
            ->where('tb_absensi.id_siswa', $data['rapor_siswa']['id_siswa'])
            ->where('tb_jadwal_pelajaran.id_kelas', $data['rapor_siswa']['id_kelas'])
            ->groupBy('tb_absensi.status')
            ->findAll();
---
SELECT `tb_absensi`.`status`, COUNT(tb_absensi.status) as jumlah
FROM `tb_absensi`
LEFT JOIN `tb_jadwal_pelajaran` ON `tb_absensi`.`id_jadwal_pelajaran` = `tb_jadwal_pelajaran`.`id`
WHERE `tb_absensi`.`id_siswa` = '53'
AND `tb_jadwal_pelajaran`.`id_kelas` = '6'
GROUP BY `tb_absensi`.`status`