app/Controllers/C_tahun_ajaran.php

SELECT *
FROM `tb_tahun_ajaran`
ORDER BY `tb_tahun_ajaran`.`tahun_ajaran` DESC, `tb_tahun_ajaran`.`semester` DESC
---
    public function index()
    {
        $data['title']        = 'Daftar Data Peran';
        $data['tahun_ajaran'] = $this->M_tahun_ajaran
            ->orderBy('tb_tahun_ajaran.tahun_ajaran', 'desc')
            ->orderBy('tb_tahun_ajaran.semester', 'desc')
            ->findAll();